# CurveAndSurfaceDoNotIntersect Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..GeometryFailures..::..CurveAndSurfaceDoNotIntersect Property
BuiltInFailures..::..GeometryFailures Class See Also
---
Curve and Surface do not intersect.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CurveAndSurfaceDoNotIntersect { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CurveAndSurfaceDoNotIntersect As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CurveAndSurfaceDoNotIntersect {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..GeometryFailures Class
Autodesk.Revit.DB Namespace